<?php

use Illuminate\Database\Seeder;

class ArticlesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = ["欧洲举办最早也是最大型的公路自行车比赛是？",  "天干地支纪年法多少年为一个甲子？","长篇小说《百年孤独》的作者是？","下列哪座城市没有举办定期电影节？","下列哪个不是宫崎骏的动漫作品？", "唐宋八大家中「三苏」不包括下列哪一位？","和服是哪个国家的民族服装？","唐代诗人李绅的《悯农》中，「谁知盘中餐」的下一句是？","古希腊哪个国家的儿童一出世就要受到严格挑选，体质弱的会被抛之荒野？ ", "加拿大最大的城市是？","以下哪个国家采用220V至230V电压？", "以下哪位不属于古希腊三大悲剧家？","我国「全运会」每几年举办一次？", "清军入关时的关指哪里？","中药「双黄连口服液」中不包含下列哪种成分？","电视剧《三国演义》中，被称为「凤雏先生」的是？","关于浓硫酸的稀释过程描述正确是？","经常被用来辨别方向的北极星是属于哪个星座的？","「未」是地支之一，在五行里代表？","猕猴桃原产地是中国的哪个省？", "代表着淘宝卖家的等级，除了红桃心、钻石外，还有什么图案？", "电影《楚门的世界》里，楚门最后是通过什么交通工具离开他生活的「世界」？","「夏满芒夏暑相连」中「芒」指的是？","下列不属于计算机设计辅助软件的是？","一个二分音符的时值等同于多少个八分音符的时值？","到2017年为止，世界上最长的人工河是？","化妆品中常见的「粉底」作用通常不包括？","被称为「第一次世界大战导火索」的事件是？","京剧是在清代什么年间形成的？", "下面哪一部不属于著名导演莱昂内的往事三部曲？","我国古代历史上出现的「九品中正制」属于哪种制度？","相传我国古代发明纺织技术的是？","吕丽萍主演的电视剧《围城》中，男主角方鸿渐的饰演者是？","我国「北海舰队」基地所处的地理位置是？","明朝三大才子中学问最为渊博，足以排名第一的是？","黄梅戏发展壮大于哪里？","下列哪一部小说不是余华的作品？","下列哪位不是「清华国学四大导师」之一？","中国五大淡水湖之一的「巢湖」位于哪个省？","小说《霍乱时期的爱情》的作者是？","「醉翁之意不在酒」的典故出自哪一部文言文？", "「MAY」是表示哪个月份的英文单词的缩写？","「寒塘渡鹤影，冷月葬花魂」这句诗词出自？","三国时期的官渡之战是曹操与谁开战？","「越是禁止的东西，人们越想要得到手」在心理学上被称为什么效应？","电影《活着》的女主演是？", "理科", "地球到月球的距离大约是？", "云南省实行走婚的少数民族是？","2016年，中国球员周琦进入NBA休斯顿火箭队，身披几号球衣？","原热河省省会是？","「Theolder,thewiser」的汉译是？","《哈利·波特》系列电影中，不能说名字的大魔头自称为？", "金融服务业属于第几产业？", "金庸和徐志摩的关系是以下哪种关系？","我国现今所知流传年代最早的琵琶曲是？","《三国演义》中被称为「三姓家奴」的人是？","「君当作磐石，妾当作蒲苇」出自何处？","「菩提本无树，明镜亦非台，本来无一物，何处惹尘埃」出自谁的诗句？","神农氏尝百草，神农氏是谁？", "被誉为「旋律大师」的是？","在数学公式中，我们一般用哪个英文字母标注图形的高？","我国第一部「语录体」著作是？","中国历史上哪个朝代「厚葬」成风？","1984年开播的《黑猫警长》是由以下哪个制片厂发行的？","「香格里拉」是一部美国小说中世外桃源的名字，它在哪里？","自然现象「海市蜃楼」在哪个季节最容易发生？","2017年「闰月」是哪个月？","味精的主要成分是？",  "长篇小说《藏地密码》的作者是？","「水能载舟，亦能覆舟」是谁所说？","「西楚霸王」指的是哪个历史人物？","我国第一次载人航天活动中，航天员杨利伟乘坐的的航天飞船是？","下列哪个国家是从马来西亚分离出来的？","下列哪个国家不在欧洲？", "《封神演义》中助纣为虐，姜子牙的同门师弟叫什么名字？", "空气中SO2形成的二次污染是？","「皮蛋」中因含有哪种重金属所以不宜多食？","「寻寻觅觅，冷冷清清，凄凄惨惨戚戚」出自哪部作品？","世界上第一所西餐与西点人才专业培训学校是哪所学校？","欧洲与北美洲的分界线是？", "鲁迅在《新青年》上发表的第一篇白话文小说是？","常说的「天网恢恢」的下一句是？","碳排在元素周期表的第几位？","下列人物中属于「竹林七贤」之一的是？","文玩中的「狮子头」其实指的是什么？","医用酒精根据不同用途分为不同浓度，消毒用医用酒精浓度是？", "人体中含量最多的物质是？","「庭有枇杷树，吾妻死之年所手植也」出自下列哪篇文章？","「待到山花烂漫时，她在丛中笑」是下列那首诗中的诗句？","以下哪一种疾病不属于遗传病？","1米等于多少分米？", "京杭大运河，是哪个皇帝时期修建的？","阿童木的鞋子是什么颜色的？","席勒在哪本书中首次提出了「美育」这一概念？","藏传佛教「活佛转世」制度最初是由哪个教派创立的？","中国哪个朝代的土地范围最大？","以下星体中，没有大气层的是？","「胭脂泪，留人醉，几时重」的下一句是？","以下哪个星座不是土相星座？","林俊杰的《因你而在》中「我为你心跳」下一句歌词是"];

        for ($i = 1; $i < 100; $i++) {
            \App\Models\Articles::create([
                'catalog_id' => rand(1,6),
                'title' => $data[array_rand($data)],
                'thumb' => 'https://gss3.bdstatic.com/-Po3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=ef1597039cdda144da096bb48a8cb79f/a50f4bfbfbedab64e08d7ed0fc36afc379311e26.jpg',
                'content' => '由于某个公众号对我仓库chinese-poetry的推广， 短时间大量涨粉， 有人想要宋词的数据。 于是最近利用零散时间对全宋词进行爬取分析， 并做了简单的分析， 发现了一些不得了的事情。

分析仅仅对全宋词的内容进行了关键字排名分析、 宋词作者产量分析、 最受欢迎的词牌名排名分析

关键字排名分析
宋人喜欢用东风， 东风作为现代也会微妙， 人间、何处从唐诗就开始蝉联前三. 即使到了现代， 这两个词依存古风.

宋词作者产量分析
辛弃疾果不其然的成为两宋现存词最多的作家, 还有一些虽然产量丰富但未必是我们熟知的。

最受欢迎的词牌名排名分析
浣溪沙作为婉约 豪放两派所常用的词牌， 在两宋时期作为最受欢迎也是理所应当.

爬取逻辑没有做相应的系统化处理， 只是简单的脚本， 配置交互式界面做的操作。采用的相关技术: Python + parsel + peewee + requests + jieba

附上爬取解析脚本的逻辑:\

运行
分别保存上面两个脚本为parse.py和db.py, 然后执行以下命令

Bash
$ pip install peewee parsel requests
$ python db.py # 初始化数据库
$ python parse.py',
                'index_rec_status' => '1',
                'index_banner_rec_status' => '1',
                'index_banner_rec_thumb' => 'https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1524734680380&di=c1ebd6ae966e7216b328d774c156191b&imgtype=0&src=http%3A%2F%2Fimg.zcool.cn%2Fcommunity%2F01e1d8596a4778a8012193a32eaf45.jpg',
                'status' => 1
            ]);
        }
    }
}
